#casks - for extra functionality
tap 'homebrew/bundle'                     # bundler for non ruby dependencies
tap 'buo/cask-upgrade'                    # to upgrade all the apps installed by homebrew cask
tap 'homebrew/core'                       # default tap installed - for linux use 'homebrew/linux-brew/core'
tap 'homebrew/bundle'
tap 'homebrew/cask-versions'

# Command line utils
brew 'coreutils'        # Those that come with macOS are outdated
brew 'findutils'
brew 'moreutils'

# Unix tools
brew 'ctags'
brew 'cmake'
brew 'diff-so-fancy'
brew 'iftop'            # Display an interface's bandwidth usage
brew 'gh'               # Github commandline: https://github.com/cli/cli
brew 'gpg'
brew 'git'              # latest version of git
brew 'grep'
brew 'htop'
brew 'httpie'
brew 'hub'              # GitHub commandline extensions: https://hub.github.com/
brew 'jq'
brew 'mas'              # Mac App Store manager to install mac apps from the store using commandline
brew 'openssl'
brew 'readline'         # Utilities that one needs....
brew 'the_silver_searcher'
brew 'vim'
brew 'wget'

# Programming language prerequisites and package managers
brew 'libtool'          # asdf dependency
brew 'libxslt'          # asdf dependency
brew 'libyaml'          # asdf - should come after openssl

# development tools
brew 'go'               # needed for docker, and other tools
brew 'go-md2man'        # needed for docker
brew 'python3'

# apps
cask 'docker'           # docker - containerise all the things
cask "gpg-suite"        # for encryption - do we need this?
cask 'iterm2'           # item - terminal alternative
cask 'intellij-idea'    # IntelliJ professional - licence required
cask 'postman'          # Postman - for API development and testing
cask 'slack'            # Slack - for comms
cask 'stats'		        # Useful stats at a glance from the menu 
cask 'visual-studio-code' # Excellent text editor / ide with a load of plugins

# browsers
cask 'firefox'
cask 'google-chrome'

# Quicklook
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'quicklook-csv'
cask 'qlimagesize'
cask 'qlvideo'

# GCP command line tools
cask 'google-cloud-sdk'
